{
  "head.title": "Aleksei Deriushev - Ingeniero Front-end Senior",
  "head.description": "Aleksei Deriushev - Ingeniero Front-end Senior con más de 12 años de experiencia en React, TypeScript y Node.js. Con sede en Barcelona, España.",

  "nav.about": "Sobre mí",
  "nav.skills": "Habilidades",
  "nav.experience": "Experiencia",
  "nav.projects": "Proyectos",
  "nav.contact": "Contacto",

  "hero.title": "Ingeniero Front-end Senior",
  "hero.tagline": "Llevo más de 12 años haciendo apps web, móviles y de escritorio que funcionan rápido",
  "hero.downloadCV": "Descargar CV",
  "hero.github": "GitHub",
  "hero.linkedin": "LinkedIn",
  "hero.location": "📍 Barcelona, España",

  "about.title": "Sobre mí",
  "about.paragraph1": "Trabajo como ingeniero de software desde hace <strong>más de 12 años</strong>, haciendo apps web, móviles y de escritorio que van rápido. Me especializo en React, TypeScript y Node.js, y me manejo bien con arquitectura frontend, optimización de rendimiento y sistemas de diseño que escalan.",
  "about.paragraph2": "He trabajado en muchos sectores: plataformas de streaming, fintech, blockchain, mapas, marketing de influencers y e-commerce. Mezclo conocimiento técnico con capacidad de adaptarme, y he trabajado en startups, empresas grandes y como líder de equipo en varios países.",
  "about.paragraph3": "Fuera del trabajo, me encanta correr, soy padre de mi hijo Miron y juego al ajedrez en Lichess. Me gusta resolver problemas complicados y siempre estoy aprendiendo tecnologías nuevas.",

  "skills.title": "Habilidades clave",
  "skills.frontend": "Frontend",
  "skills.backend": "Backend",
  "skills.testing_tools": "Pruebas y herramientas",
  "skills.devops_cloud": "DevOps y Cloud",

  "experience.title": "Experiencia profesional",
  "experience.rakuten.companyType": "📺 Plataforma de streaming (TVOD/AVOD)",
  "experience.rakuten.bullet1": "Mejoré el rendimiento del sitio web, la UX y la escalabilidad para millones de usuarios",
  "experience.rakuten.bullet2": "Diseñé e implementé nuevas funcionalidades y optimizaciones en toda la plataforma",
  "experience.rakuten.bullet3": "Obtuve conocimientos profundos sobre la arquitectura de plataformas de streaming",
  "experience.aldrin.companyType": "💰 Fintech blockchain",
  "experience.aldrin.bullet1": "Construí y mantuve el SDK Web3 e integré carteras de terceros",
  "experience.aldrin.bullet2": "Trabajé en pools, swaps y funcionalidades DeFi basadas en Solana",
  "experience.nrds.companyType": "📍 Aplicación móvil con funciones de mapa avanzadas",
  "experience.nrds.bullet1": "Desarrollé y optimicé funcionalidades móviles complejas en aplicaciones basadas en mapas",
  "experience.nrds.bullet2": "Resolví desafíos críticos de rendimiento en aplicaciones a gran escala",
  "experience.nrds.bullet3": "Contribuí a tareas de liderazgo y compartición de conocimientos",
  "experience.itx100.companyType": "🍽️ Plataforma de tecnología alimentaria",
  "experience.itx100.bullet1": "Abordé problemas complejos de rendimiento guiado por auditorías de Lighthouse",
  "experience.itx100.bullet2": "Facilité sesiones de compartición de conocimientos",
  "experience.labelup.companyType": "📢 Plataforma de marketing de influencers",
  "experience.labelup.bullet1": "Construí y escalé todo el ecosistema front-end",
  "experience.labelup.bullet2": "Introduje mejoras de rendimiento y procesos impulsados por Agile",
  "experience.labelup.bullet3": "Realicé onboarding, entrevistas y mentoría",
  "experience.itechart.companyType": "🧳 Extensión de Chrome para viajes corporativos",
  "experience.itechart.bullet1": "Recopilé requisitos y coordiné con las partes interesadas",
  "experience.itechart.bullet2": "Introduje GraphQL al flujo de trabajo",
  "experience.itechart.bullet3": "Entregué funcionalidades complejas críticas para el rendimiento",
  "experience.enaza.companyType": "🎮 Plataforma de distribución de software",
  "experience.enaza.bullet1": "Contribuí a los sistemas backend que impulsan el comercio electrónico de software y juegos en línea",

  "projects.title": "Proyectos personales",
  "projects.viewProject": "Ver proyecto →",
  "projects.cm.description": "Aplicación de gestión de tareas de equipo para una colaboración fluida. Crea, asigna y rastrea tareas en tiempo real con tu equipo.",
  "projects.n3ws.description": "Noticias en 3 palabras - Titulares ultra-concisos de Rusia, España y todo el mundo impulsados por IA.",
  "projects.palabrino.description": "Aprende vocabulario español mediante el aprendizaje visual. Relaciona palabras españolas con imágenes en un juego de aprendizaje de idiomas atractivo.",
  "projects.adchange.description": "Rastrea RUB/USDT/EUR en vivo, compara rutas directas vs indirectas con ahorros reales, visualiza gráficos de historial y convierte al instante (React Native + Firebase).",

  "contact.title": "Contacto",
  "contact.description": "Siempre abierto a hablar de nuevas oportunidades, proyectos interesantes o simplemente charlar sobre tecnología.",

  "footer.copyright": "© 2025 Aleksei Deriushev. Todos los derechos reservados."
}

